![data-x](https://raw.githubusercontent.com/afo/data-x-plaksha/master/imgsource/dx_logo.png)

---
# Notebook: SQL in Python

**Author list:** 
- Alexander Fred Ojala
- Sindhuja Jeyabal
- Ishaan Malhi

**References / Sources:** 


**License Agreement:** Feel free to do whatever you want with this code

___

# Table of Contents

### * [Basics: sqlite3 (Python builtin)](#sec1)
### * [Pandas and SQL](#sec2)
### * [ORM: SQLAlchemy](#sec4)
### * [Breakout](#sec3)

## SQLite 3

A SQL database *engine*

https://sqlite.org/index.html

Database engines are *implementations* of standard SQL.

ANSI SQL (the query language) works on pretty much every engine. 
Most engines extend the language with some custom commands as well (usually for db administration).

Some examples of SQL engines are:
1. MySQL
2. MariaDB
3. PostgresSQL

Checkout database engines here: https://db-engines.com/en/ranking

These include a mix of SQL and non-SQL database engines.

We know that SQL stores records in row-column format, what is called structured data. 

Poll: Can we store json data in SQL databases?

https://fast-poll.com/poll/5d69eb53

JSON is unstructured data that might look something like this:

```json
{
    'course': {
        'name': 'data-x'
        'dept': 'ieor'
    },
    'offerings': ['spring 2020']
}
```

<img src="https://media.giphy.com/media/3ofT5NbBuEq6GQ65Q4/giphy.gif" />

Yes we can! Latest versions of most sql engines support json documents.

That said, these aren't as robust as storing records as row-column formats.

MySQL JSON: https://dev.mysql.com/doc/refman/5.7/en/json.html

PostgreSQL: https://www.postgresql.org/docs/9.4/datatype-json.html

In [2]:
# sqlite3 package comes with the Python installation
import sqlite3

In [3]:
# list files in w.d.
!ls

311_NYC.csv           breakout.db           intro-to-dbs-sql.pdf
311_NYC.db            company.db            python-sql.ipynb
README.md             extra_material        sql-breakout.ipynb
archive               imgs                  sqlalchemy_example.db

In [4]:
!rm company.db

In [5]:
# open connnection to a db file stored locally on disk
# if file doesn't exist it is created
connection = sqlite3.connect('company.db')

In [6]:
!ls # file is created

311_NYC.csv           breakout.db           intro-to-dbs-sql.pdf
311_NYC.db            company.db            python-sql.ipynb
README.md             extra_material        sql-breakout.ipynb
archive               imgs                  sqlalchemy_example.db

In [7]:
# In order to run SQL commands with
# sqlite 3 we must create a cursor object
# that traverses the database
cursor = connection.cursor()

# to run sql commands execute them

In [8]:
# Ensure that we are working with an empty db
cursor.execute("DROP TABLE IF EXISTS employee;")

In [9]:
# We can define long SQL commands within three quotes

sql_command = """
CREATE TABLE employee (
staff_number INTEGER PRIMARY KEY,
fname VARCHAR(20),
lname VARCHAR(30),
gender CHAR(1),
joining DATE,
birth_date DATE);"""

# VARCHAR string that can be up to X characters
# CHAR has to be X characters

**Link to SQL datatypes:** [https://www.w3schools.com/sql/sql_datatypes.asp](https://www.w3schools.com/sql/sql_datatypes.asp)

More Resources:
- https://www.codecademy.com/learn/learn-sql
- https://www.khanacademy.org/computing/computer-programming/sql

In [10]:
# In order to run SQL command on the databse file
# we have to execute them with the cursor
cursor.execute(sql_command)

In [11]:
sql_command = '''
INSERT INTO employee
(staff_number, fname, lname, gender, birth_date)
VALUES
(NULL, "William", "Shakespeare", "m", "1961-10-25");'''

cursor.execute(sql_command)

In [12]:
sql_command = '''
INSERT INTO employee 
(staff_number, fname, lname, gender, birth_date) 
VALUES (NULL, "Frank", "Schiller", "m", "1955-08-17");'''


cursor.execute(sql_command)

In [13]:
# never forget to commit your queries
# if you have updated the database
# and close the connection when you're done

connection.commit() 

connection.close()

- commit() is an SQL transaction operation. It ensures Atomicity, Consistency, Isolation and Durability (ACID)


- Remember to always close connections! 

- Hanging connections lead to all sorts of random problems like memory leaks, your database getting overloaded with keeping many connections from the same program alive etc
    - Most databases implement a connection close timer, which closes connections that haven't been used in a while.
    - That said, it's a bandaid solution, so always close your connections

In [15]:
# reopen the connection and create cursor
connection = sqlite3.connect('company.db')

cursor = connection.cursor()

In [16]:
a = cursor.execute('SELECT * FROM employee;')

In [17]:
# # fetch values, a.fetchall is a generator object
for row in a.fetchall():
    print(row)

(1, 'William', 'Shakespeare', 'm', None, '1961-10-25')
(2, 'Frank', 'Schiller', 'm', None, '1955-08-17')

In [18]:
# close connection
connection.close()

In [20]:
# Assume we already have a company.db sqlite database file
# with a Table called employees

# Add several values with sqlite3 and string formatting

connection = sqlite3.connect("company.db")

cursor = connection.cursor()

In [21]:

# list of tuples we want to add to the database
staff_data = [ ("Alfred", "Nobel", "m", "1921-05-02"), \
              ("Klaus", "Kinski", "m", "1935-09-07"),  \
              ("Jane", "Wall", "f", "1989-05-03") ]

for p in staff_data:
    
    # define string to be formatted, name format placeholders within curly brackets
    format_str = '''
    INSERT INTO employee (staff_number, fname, lname, gender, birth_date)    
    VALUES (NULL, "{first}", "{last}", "{gender}", "{birthdate}");
    '''

    # define SQL command
    sql_command = format_str.format(first=p[0], last=p[1], 
                                gender=p[2], birthdate = p[3]) 
    
    cursor.execute(sql_command)
    
# Commit changes
connection.commit()

In [22]:
# Check that the changes were committed
cursor.execute("SELECT * FROM employee") 

print("fetchall:") 

result = cursor.fetchall() 

for r in result:

    print(r)

fetchall:
(1, 'William', 'Shakespeare', 'm', None, '1961-10-25')
(2, 'Frank', 'Schiller', 'm', None, '1955-08-17')
(3, 'Alfred', 'Nobel', 'm', None, '1921-05-02')
(4, 'Klaus', 'Kinski', 'm', None, '1935-09-07')
(5, 'Jane', 'Wall', 'f', None, '1989-05-03')

In [23]:
# Alternative approach

# Count rows in the database
n_rows = cursor.execute('SELECT Count(*) FROM employee').fetchone()[0]

res = cursor.execute("SELECT * FROM employee") 

print("\nFetch one at a time:") 
for i in range(0,n_rows): # we need to unpack
    tmp = res.fetchone() 

    print(tmp)

Fetch one at a time:
(1, 'William', 'Shakespeare', 'm', None, '1961-10-25')
(2, 'Frank', 'Schiller', 'm', None, '1955-08-17')
(3, 'Alfred', 'Nobel', 'm', None, '1921-05-02')
(4, 'Klaus', 'Kinski', 'm', None, '1935-09-07')
(5, 'Jane', 'Wall', 'f', None, '1989-05-03')

# Quick Data Analysis with SQL and Pandas

### Preferred method when running SELECT statements

In [24]:
import pandas as pd
import datetime as dt

In [25]:
# this gives the output as a dataframe
pd.read_sql_query('SELECT * FROM employee',con = connection)

   staff_number    fname        lname gender joining  birth_date
0             1  William  Shakespeare      m    None  1961-10-25
1             2    Frank     Schiller      m    None  1955-08-17
2             3   Alfred        Nobel      m    None  1921-05-02
3             4    Klaus       Kinski      m    None  1935-09-07
4             5     Jane         Wall      f    None  1989-05-03

#### Initialize database with filename 311_NYC.db in current working directory

In [26]:
!head -n10 311_NYC.csv

index,CreatedDate,ClosedDate,Agency,ComplaintType,Descriptor,City
1,"2011-06-20 10:53:34","2011-06-20 15:15:10",DOF,"DOF Property - Owner Issue","Remove Mortgage","GLEN OAKS"
2,"2011-06-20 10:43:46","2011-06-30 11:33:32",DOT,"Street Condition","Defective Hardware",BROOKLYN
3,"2011-06-20 11:14:08","2011-06-21 18:41:35",DHS,"DHS Advantage - Tenant","Other Issue","SOUTH RICHMOND HILL"
4,"2011-06-20 11:19:17","2011-06-20 14:11:47",DOT,"Broken Muni Meter","No Receipt","FOREST HILLS"
5,"2011-06-20 11:41:47","2011-06-27 10:22:55",DOF,SCRIE,"SCRIE Recertification","NEW YORK"
6,"2011-06-20 11:39:36","2011-06-24 09:07:31",DOF,SCRIE,"SCRIE Application Problem",BROOKLYN
7,"2011-06-20 12:47:17","2011-06-21 09:59:33",DOF,"DOF Property - Reduction Issue","Condo or Co-op Abatement",BROOKLYN
8,"2011-06-20 13:08:49","2011-06-22 13:43:12",DOF,"DOF Property - Payment Issue","Misapplied Payment","QUEENS VILLAGE"
9,"2011-06-20 00:00:00","2011-07-18 00:00:00",DOHMH,Rodent,"Rat Sighting","NEW YORK"

In [27]:
!wc -l 311_NYC.csv #number of lines

   40001 311_NYC.csv

In [28]:
connection = sqlite3.connect('311_NYC.db')

### Read in big CSV file to Database

Original data set can be downloaded here (several GB's): https://nycopendata.socrata.com/Social-Services/311-Service-Requests-from-2010-to-Present/erm2-nwe9

In [29]:
start = dt.datetime.now()
chunksize = 20000 # number of rows to put in at a time
j = 0
index_start = 1

for df in pd.read_csv('311_NYC.csv', chunksize=chunksize, iterator=True, encoding='utf-8'):
    
    df = df.rename(columns={c: c.replace(' ', '') for c in df.columns}) # Remove spaces from columns

    df['CreatedDate'] = pd.to_datetime(df['CreatedDate']) # Convert to datetimes
    df['ClosedDate'] = pd.to_datetime(df['ClosedDate'])

    df.index += index_start

    # Columns to keep
    columns = ['Agency', 'CreatedDate', 'ClosedDate', 'ComplaintType', 'Descriptor',
               'TimeToCompletion','City']
    for c in df.columns:
        if c not in columns:
            df = df.drop(c, axis=1)    
    
    j+=1
    df.to_sql('data', connection, if_exists='append') # name of SQL table, connection, append
    print('{} seconds: completed {} rows'.format((dt.datetime.now() - start).seconds, j*chunksize))
    
    index_start = df.index[-1] + 1 # update index start

0 seconds: completed 20000 rows
0 seconds: completed 40000 rows

#### Preview the DataBase

In [30]:
pd.read_sql_query('SELECT * FROM data', connection).head()

,index,CreatedDate,ClosedDate,Agency,ComplaintType,Descriptor,City
0,1,2011-06-20 10:53:34,2011-06-20 15:15:10,DOF,DOF Property - Owner Issue,Remove Mortgage,GLEN OAKS
1,2,2011-06-20 10:43:46,2011-06-30 11:33:32,DOT,Street Condition,Defective Hardware,BROOKLYN
2,3,2011-06-20 11:14:08,2011-06-21 18:41:35,DHS,DHS Advantage - Tenant,Other Issue,SOUTH RICHMOND HILL
3,4,2011-06-20 11:19:17,2011-06-20 14:11:47,DOT,Broken Muni Meter,No Receipt,FOREST HILLS
4,5,2011-06-20 11:41:47,2011-06-27 10:22:55,DOF,SCRIE,SCRIE Recertification,NEW YORK

#### Select a few columns

2 Approaches

1. Select columns from database directly

In [31]:
pd.read_sql_query('SELECT Agency, Descriptor FROM data LIMIT 3', connection).head()

  Agency          Descriptor
0    DOF     Remove Mortgage
1    DOT  Defective Hardware
2    DHS         Other Issue

 2. Select all columns from the database and filter from pandas dataframe.

In [32]:
pd.read_sql_query('SELECT * FROM data LIMIT 3', connection)[['Agency', 'Descriptor']].head()

  Agency          Descriptor
0    DOF     Remove Mortgage
1    DOT  Defective Hardware
2    DHS         Other Issue

# Poll

Which one would you use?

https://fast-poll.com/poll/4c304707

It depends on your use case.

1. If the data is wide (columns >> rows), and you need a small subset of the columns, use the sql query. That way the database can optimize for your query and the data transferred between your database and your program is smaller.

2. If you need most of the columns (as features) and you might need them later, AND/OR need to select columns based on some application logic after you pull the data, use the pandas dataframe column select.

#### Filter rows using WHERE

In [33]:
# we can also save the output as a DataFrame
df = pd.read_sql_query('SELECT ComplaintType, Descriptor, Agency '
                       'FROM data '
                       'WHERE Agency = "DOT" '
                       'LIMIT 10', connection)
df

            ComplaintType                      Descriptor Agency
0        Street Condition              Defective Hardware    DOT
1       Broken Muni Meter                      No Receipt    DOT
2        Street Condition                         Cave-in    DOT
3      Sidewalk Condition          Blocked - Construction    DOT
4    Broken Parking Meter   Coin or Card Did Not Register    DOT
5  Street Light Condition                Street Light Out    DOT
6        Street Condition  Rough, Pitted or Cracked Roads    DOT
7      Sidewalk Condition   Dumpster - Construction Waste    DOT
8        Street Condition          Blocked - Construction    DOT
9        Street Condition                         Cave-in    DOT

#### Filter multiple values in a column using IN

In [34]:
df = pd.read_sql_query('SELECT ComplaintType, Descriptor, Agency '
                       'FROM data '
                       'WHERE Agency IN ("NYPD", "DOB")'
                       'LIMIT 20', connection)
df.head()

             ComplaintType        Descriptor Agency
0  Noise - Street/Sidewalk  Loud Music/Party   NYPD
1         Blocked Driveway         No Access   NYPD
2         Blocked Driveway         No Access   NYPD
3         Blocked Driveway    Partial Access   NYPD
4      Noise - Residential  Loud Music/Party   NYPD

#### Find Unique values using DISTINCT

In [35]:
df = pd.read_sql_query('SELECT DISTINCT Agency FROM data', connection)
df

   Agency
0     DOF
1     DOT
2     DHS
3   DOHMH
4    NYPD
5     DPR
6     EDC
7     TLC
8     DOB
9     DCA
10    DOE
11   DFTA
12   FDNY
13    HPD
14    DEP
15   DSNY
16  DOITT
17  3-1-1

####  Query values using Count(*) and GROUP BY and ORDER BY

#### Which agency receives the most complaints?

In [36]:
sql_command = '''
SELECT Agency, Count(*) 
AS num_complaints 
FROM data 
GROUP BY Agency 
ORDER BY num_complaints DESC'''

pd.read_sql_query(sql_command,connection)

   Agency  num_complaints
0     HPD           50704
1     DOT           25416
2    NYPD           20712
3     DEP           13520
4    DSNY            9336
5     DPR            9104
6     DOF            8952
7     DOB            8408
8   DOHMH            5112
9     DHS            3048
10    DCA            2184
11    TLC            1928
12   DFTA             960
13    DOE             304
14   FDNY             152
15    EDC              80
16  3-1-1              48
17  DOITT              32

## GROUP BY is an aggregation operation. It needs a metric in the select query such as COUNT, MAX etc

#### What is the most common complaint type?

In [40]:
df = pd.read_sql_query('SELECT ComplaintType, Count(*) AS num_complaints '
                       'FROM data '
                       'GROUP BY ComplaintType '
                       'ORDER BY num_complaints DESC', connection)

df.head()

            ComplaintType  num_complaints
0    GENERAL CONSTRUCTION           13600
1  Street Light Condition           10768
2                PLUMBING           10096
3         PAINT - PLASTER            9512
4                NONCONST            8960

#### Number of complaints per city for the top 10 cities with most complaints

In [41]:
sql_command = '''
SELECT City, Count(*) AS num_complaints
FROM Data
GROUP BY City
ORDER BY num_complaints DESC
LIMIT 10
'''

df = pd.read_sql_query(sql_command, connection)
df

            City  num_complaints
0       BROOKLYN           52280
1          BRONX           28688
2       NEW YORK           25744
3  STATEN ISLAND            8904
4           None            8688
5        JAMAICA            4592
6       FLUSHING            3000
7        ASTORIA            2368
8      RIDGEWOOD            1880
9         CORONA            1360

#### Perform Case Insensitive Queries

In [43]:
sql_command = '''
SELECT City, Count(*) AS num_complaints
FROM Data
GROUP BY City COLLATE NOCASE
ORDER BY num_complaints DESC
LIMIT 10
'''
df = pd.read_sql_query(sql_command, connection)
df # Jamaica, Flushing etc have more complaints now

            City  num_complaints
0       BROOKLYN           52280
1          BRONX           28688
2       NEW YORK           25744
3  STATEN ISLAND            8904
4           None            8688
5        JAMAICA            4624
6       FLUSHING            3056
7        ASTORIA            2400
8      RIDGEWOOD            1896
9         CORONA            1376

# ORM: Object Relational Mapper

# Use SQLAlchemy to define tables as classes
### Make use of ORM (Object Relational Mapper)
Great for large scale systems

In [44]:
import os
import sys
from sqlalchemy import Column, ForeignKey, Integer, String
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import relationship
from sqlalchemy import create_engine
 
Base = declarative_base()
 
class Person(Base):
    __tablename__ = 'person'
    # Here we define columns for the table person
    # Notice that each column is also a normal Python instance attribute.
    id = Column(Integer, primary_key=True)
    name = Column(String(250), nullable=False)
    
class Address(Base):
    __tablename__ = 'address'
    # Here we define columns for the table address.
    # Notice that each column is also a normal Python instance attribute.
    id = Column(Integer, primary_key=True)
    street_name = Column(String(250))
    street_number = Column(String(250))
    post_code = Column(String(250), nullable=False)
    person_id = Column(Integer, ForeignKey('person.id'))
    person = relationship(Person)
    
    
# Create an engine that stores data in the local directory's
# sqlalchemy_example.db file.
engine = create_engine('sqlite:///sqlalchemy_example.db')
 
# Create all tables in the engine. This is equivalent to "Create Table"
# statements in raw SQL.
Base.metadata.create_all(engine)

In [45]:
from sqlalchemy.orm import sessionmaker
 
# Bind the engine to the metadata of the Base class so that the
# declaratives can be accessed through a DBSession instance
Base.metadata.bind = engine

DBSession = sessionmaker(bind=engine)
# A DBSession() instance establishes all conversations with the database
# and represents a "staging zone" for all the objects loaded into the
# database session object. Any change made against the objects in the
# session won't be persisted into the database until you call
# session.commit(). If you're not happy about the changes, you can
# revert all of them back to the last commit by calling
# session.rollback()
session = DBSession()
 
# Insert a Person in the person table
new_person = Person(name='new person')
session.add(new_person)
session.commit()
 
# Insert an Address in the address table
new_address = Address(post_code='00000', person=new_person,
                     street_name='28th st.')
session.add(new_address)
session.commit()

In [47]:
# Make a query to find all Persons in the database
address = session.query(Address).all()
for a in address:
    print(a.street_name)



# Return the first Person from all Persons in the database
person = session.query(Person).first()
print(person.name)
# Find all Address whose person field is pointing to the person object
session.query(Address).filter(Address.person == person).all()

# Retrieve one Address whose person field is point to the person object
session.query(Address).filter(Address.person == person).one()

address = session.query(Address).filter(Address.person == person).one()
address.post_code

28th st.
28th st.
28th st.
28th st.
new person

'00000'

# Breakout Problems

[Breakout notebook](sql-breakout.ipynb)